app/Controllers/Shoppinglist.php

    public function getList()
    {
        $data = $this->ShoppingModel->findAll();
---
SELECT *
FROM `shopping`

    public function checkoff()
    {
        $id = $this->request->getPost('id');
        $checkoff = $this->request->getPost('checkoff');

        $this->ShoppingModel->set('checkoff', $checkoff)->where('id', $id)->update();
---
UPDATE `shopping` SET `checkoff` = '1'
WHERE `id` = '41'